In [1]:
import pandas as pd

## Load two dataframes

In [2]:
data = pd.read_csv(r'C:\Users\kukumar\OneDrive - AMDOCS\Backup Folders\Documents\GitHub\LearningPython\DataAnalysis_with_Python\Chipotle\chipotle.tsv',sep='\t')
data.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

## total number of rows

In [4]:
data.count()

order_id              4622
quantity              4622
item_name             4622
choice_description    3376
item_price            4622
dtype: int64

## Create DataFrame : Specify value column wise

In [134]:
df = pd.DataFrame(
{
    'customer_id':[10,100,200],
    'name':['kuldeep','raj','surabhi'],
    'Salary':[110,134,203]
}, index = [1,2,3])

In [135]:
df

   customer_id     name  Salary
1           10  kuldeep     110
2          100      raj     134
3          200  surabhi     203

## Create Dataframe : Specify value of each row

In [136]:
df = pd.DataFrame([[10,'kuldeep',200],[100,'raj',134],[200,'surabhi',203]],
                 index = [1,5,3],
                 columns = ['customer_id','name','Salary'])

In [138]:
print(df.iloc[2])

customer_id        200
name           surabhi
Salary             203
Name: 3, dtype: object

## Query Dataframe

In [26]:
df.query('Salary >= 200')

   customer_id     name  Salary
1           10  kuldeep     200
3          200  surabhi     203

## Query Dataframe : plus rename the output columns

In [35]:
df.query('name == "kuldeep" and Salary >= 200').rename(columns={'name':'first_name'})

   customer_id first_name  Salary
1           10    kuldeep     200

## Convert Column into Rows

In [40]:
df_melt = pd.melt(df)
df_melt

      variable    value
0  customer_id       10
1  customer_id      100
2  customer_id      200
3         name  kuldeep
4         name      raj
5         name  surabhi
6       Salary      200
7       Salary      134
8       Salary      203

In [64]:
df_melt.pivot(columns = 'variable',values = 'value').query('name != None')
#.dropna(how='any',axis='index')

variable Salary customer_id     name
0           NaN          10      NaN
1           NaN         100      NaN
2           NaN         200      NaN
3           NaN         NaN  kuldeep
4           NaN         NaN      raj
5           NaN         NaN  surabhi
6           200         NaN      NaN
7           134         NaN      NaN
8           203         NaN      NaN

In [68]:
pd.concat([df,df],axis = 'columns')

   customer_id     name  Salary  customer_id     name  Salary
1           10  kuldeep     200           10  kuldeep     200
2          100      raj     134          100      raj     134
3          200  surabhi     203          200  surabhi     203

In [70]:
df2=pd.concat([df,df,df])

In [77]:
df2[df2.Salary > 200]

   customer_id     name  Salary
3          200  surabhi     203
3          200  surabhi     203
3          200  surabhi     203

## Write a program in python for getting a csv data in dataframe and get the total unique values in a target column and get the frequency of a specific value in a target column.

In [122]:
t_data = pd.read_csv(r'C:\Users\kukumar\OneDrive - AMDOCS\Backup Folders\Documents\GitHub\LearningPython\DataAnalysis_with_Python\DataFrames\stores data-set.csv')
t_data.head(5)

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [123]:
t_data.Type.unique()

array(['A', 'B', 'C'], dtype=object)

In [124]:
t_data.Type.value_counts()

A    22
B    17
C     6
Name: Type, dtype: int64

In [127]:
#t_data.query('Type=="A"').count()
t_df = t_data.groupby('Type').count()

In [128]:
t_df.query('Type=="A"').Store.to_list()

[22]